<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
!pip install sqlalchemy==1.3.9

Requirement already satisfied: sqlalchemy==1.3.9 in c:\users\haseeb\anaconda3\lib\site-packages (1.3.9)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [1]:
%load_ext sql

In [2]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [15]:
# from sqlalchemy import create_engine

# engine = create_engine('mysql://user:RiverPark_12@3306/dbname')

In [8]:
!pip install -q pandas==1.1.5

In [9]:
# %sql sqlite:///my_data1.db

In [10]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

In [12]:
cur.execute('SELECT * FROM SPACEXTBL')

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [14]:
%sql SELECT DISTINCT Launch_Site FROM SPACEXTBL

 * sqlite:///my_data1.db
Traceback (most recent call last):
  File "C:\Users\Haseeb\anaconda3\lib\site-packages\sql\magic.py", line 203, in execute
    conn.internal_connection.rollback()
AttributeError: 'Connection' object has no attribute 'rollback'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///my_data1.db'])

In [17]:
cur.execute('SELECT DISTINCT Launch_Site FROM SPACEXTBL')
rows = cur.fetchall()
print(rows)

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',), (None,)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [8]:
%sql SELECT * FROM SPACEXTBL WHERE Launch_Site like 'CCA%' LIMIT 5

 * sqlite:///my_data1.db
Traceback (most recent call last):
  File "C:\Users\Haseeb\anaconda3\lib\site-packages\sql\magic.py", line 203, in execute
    conn.internal_connection.rollback()
AttributeError: 'Connection' object has no attribute 'rollback'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///my_data1.db'])

In [37]:
cur.execute("SELECT * FROM SPACEXTBL WHERE Launch_Site like 'CCA%' LIMIT 5")
rows = cur.fetchall()
print(rows)

[('06/04/2010', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0.0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'), ('12/08/2010', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0.0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'), ('22/05/2012', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525.0, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'), ('10/08/2012', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'), ('03/01/2013', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

In [23]:
cur.execute("SELECT * FROM SPACEXTBL WHERE Launch_Site like 'CCA%' LIMIT 5")
rows = cur.fetchall()
# print(rows)
rows=pd.DataFrame(rows)
rows

,0,1,2,3,4,5,6,7,8,9
0,06/04/2010,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0.0,LEO,SpaceX,Success,Failure (parachute)
1,12/08/2010,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0.0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,22/05/2012,7:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525.0,LEO (ISS),NASA (COTS),Success,No attempt
3,10/08/2012,0:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500.0,LEO (ISS),NASA (CRS),Success,No attempt
4,03/01/2013,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677.0,LEO (ISS),NASA (CRS),Success,No attempt

In [9]:
# %sql select * from SPACEXTBL where launch_site like 'CCA%' limit 5

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [10]:
%sql SELECT sum(payload_mass__kg_) AS SUM FROM SPACEXTBL WHERE Customer like 'NASA (CRS)'

 * sqlite:///my_data1.db
Traceback (most recent call last):
  File "C:\Users\Haseeb\anaconda3\lib\site-packages\sql\magic.py", line 203, in execute
    conn.internal_connection.rollback()
AttributeError: 'Connection' object has no attribute 'rollback'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///my_data1.db'])

In [11]:
%sql select sum(payload_mass__kg_) as sum from SPACEXTBL where customer like 'NASA (CRS)'

 * sqlite:///my_data1.db
Traceback (most recent call last):
  File "C:\Users\Haseeb\anaconda3\lib\site-packages\sql\magic.py", line 203, in execute
    conn.internal_connection.rollback()
AttributeError: 'Connection' object has no attribute 'rollback'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///my_data1.db'])

In [24]:
cur.execute("SELECT sum(payload_mass__kg_) AS SUM FROM SPACEXTBL WHERE Customer like 'NASA (CRS)'")
rows = cur.fetchall()
# print(rows)
rows=pd.DataFrame(rows)
rows

         0
0  45596.0

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [12]:
%sql SELECT AVG(payload_mass__kg_) AS AVG FROM SPACEXTBL WHERE Booster_Version like 'F9 v1.1'

 * sqlite:///my_data1.db
Traceback (most recent call last):
  File "C:\Users\Haseeb\anaconda3\lib\site-packages\sql\magic.py", line 203, in execute
    conn.internal_connection.rollback()
AttributeError: 'Connection' object has no attribute 'rollback'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///my_data1.db'])

In [25]:
cur.execute("SELECT AVG(payload_mass__kg_) AS AVG FROM SPACEXTBL WHERE Booster_Version like 'F9 v1.1' ")
rows = cur.fetchall()
# print(rows)
rows=pd.DataFrame(rows)
rows

        0
0  2928.4

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [13]:
%sql  SELECT min(date) AS DATE FROM SPACEXTBL WHERE mission_outcome like 'Success'

 * sqlite:///my_data1.db
Traceback (most recent call last):
  File "C:\Users\Haseeb\anaconda3\lib\site-packages\sql\magic.py", line 203, in execute
    conn.internal_connection.rollback()
AttributeError: 'Connection' object has no attribute 'rollback'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///my_data1.db'])

In [14]:
%sql SELECT min(date) AS DATE FROM SPACEXTBL WHERE mission_outcome like 'Success'

 * sqlite:///my_data1.db
Traceback (most recent call last):
  File "C:\Users\Haseeb\anaconda3\lib\site-packages\sql\magic.py", line 203, in execute
    conn.internal_connection.rollback()
AttributeError: 'Connection' object has no attribute 'rollback'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///my_data1.db'])

In [26]:
cur.execute("SELECT min(date) AS DATE FROM SPACEXTBL WHERE mission_outcome like 'Success'")
rows = cur.fetchall()
# print(rows)
rows=pd.DataFrame(rows)
rows

            0
0  01/06/2014

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [15]:
%sql SELECT booster_version FROM SPACEXTBL WHERE (mission_outcome like 'Success') AND (payload_mass__kg_ BETWEEN 4000 AND 6000)

 * sqlite:///my_data1.db
Traceback (most recent call last):
  File "C:\Users\Haseeb\anaconda3\lib\site-packages\sql\magic.py", line 203, in execute
    conn.internal_connection.rollback()
AttributeError: 'Connection' object has no attribute 'rollback'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///my_data1.db'])

In [16]:
%sql select booster_version from SPACEXTBL where (mission_outcome like 'Success') AND (payload_mass__kg_ BETWEEN 4000 AND 6000)

 * sqlite:///my_data1.db
Traceback (most recent call last):
  File "C:\Users\Haseeb\anaconda3\lib\site-packages\sql\magic.py", line 203, in execute
    conn.internal_connection.rollback()
AttributeError: 'Connection' object has no attribute 'rollback'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///my_data1.db'])

In [27]:
cur.execute("SELECT booster_version FROM SPACEXTBL WHERE (mission_outcome like 'Success') AND (payload_mass__kg_ BETWEEN 4000 AND 6000)")
rows = cur.fetchall()
# print(rows)
rows=pd.DataFrame(rows)
rows

                 0
0          F9 v1.1
1    F9 v1.1 B1011
2    F9 v1.1 B1014
3    F9 v1.1 B1016
4      F9 FT B1020
5      F9 FT B1022
6      F9 FT B1026
7      F9 FT B1030
8   F9 FT  B1021.2
9    F9 FT B1032.1
10   F9 B4 B1040.1
11  F9 FT  B1031.2
12  F9 FT  B1032.2
13  F9 B4  B1040.2
14   F9 B5 B1046.2
15   F9 B5 B1047.2
16   F9 B5 B1046.3
17   F9 B5 B1048.3
18  F9 B5 B1051.2
19    F9 B5B1060.1
20  F9 B5 B1058.2
21    F9 B5B1062.1

### Task 7




##### List the total number of successful and failure mission outcomes

In [17]:
%sql SELECT mission_outcome, COUNT(*) AS COUNT FROM SPACEXTBL GROUP BY mission_outcome ORDER BY mission_outcome
# %sql SELECT mission_outcome, count(*) as Count FROM SPACEXTBL GROUP by mission_outcome ORDER BY mission_outcome

 * sqlite:///my_data1.db
Traceback (most recent call last):
  File "C:\Users\Haseeb\anaconda3\lib\site-packages\sql\magic.py", line 203, in execute
    conn.internal_connection.rollback()
AttributeError: 'Connection' object has no attribute 'rollback'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///my_data1.db'])

In [28]:
cur.execute("SELECT mission_outcome, COUNT(*) AS COUNT FROM SPACEXTBL GROUP BY mission_outcome ORDER BY mission_outcome")
rows = cur.fetchall()
# print(rows)
rows=pd.DataFrame(rows)
rows

                                  0    1
0                              None  898
1               Failure (in flight)    1
2                           Success   98
3                          Success     1
4  Success (payload status unclear)    1

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [48]:
# %sql select BOOSTER_VERSION from SPACEXTBL where PAYLOAD_MASS__KG_ = (select max(PAYLOAD_MASS__KG_) from SPACEXTBL)

In [29]:
cur.execute("select BOOSTER_VERSION from SPACEXTBL where PAYLOAD_MASS__KG_ = (select max(PAYLOAD_MASS__KG_) from SPACEXTBL)")
rows = cur.fetchall()
# print(rows)
rows=pd.DataFrame(rows)
rows

                 0
0    F9 B5 B1048.4
1    F9 B5 B1049.4
2    F9 B5 B1051.3
3    F9 B5 B1056.4
4    F9 B5 B1048.5
5    F9 B5 B1051.4
6    F9 B5 B1049.5
7   F9 B5 B1060.2
8   F9 B5 B1058.3
9    F9 B5 B1051.6
10   F9 B5 B1060.3
11  F9 B5 B1049.7

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [46]:
# %sql SELECT EXTRACT(MONTH, select min(DATE) from SPACEXTBL where Landing__Outcome = 'Success (ground pad)')

In [40]:
cur.execute("SELECT CASE substr(Date, 4, 2) WHEN '01' THEN 'January' WHEN '02' THEN 'February' WHEN '03' THEN 'March' WHEN '04' THEN 'April' WHEN '05' THEN 'May' WHEN '06' THEN 'June' WHEN '07' THEN 'July' WHEN '08' THEN 'August' WHEN '09' THEN 'September' WHEN '10' THEN 'October' WHEN '11' THEN 'November' WHEN '12' THEN 'December' END AS Month, landing_outcome, booster_version, launch_site FROM SPACEXTBL WHERE substr(Date,7,4)='2015'")
rows = cur.fetchall()
# print(rows)
rows=pd.DataFrame(rows)
rows.columns = [description[0] for description in cur.description]
rows

      Month         Landing_Outcome Booster_Version  Launch_Site
0   October    Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1  November      Controlled (ocean)   F9 v1.1 B1013  CCAFS LC-40
2  February              No attempt   F9 v1.1 B1014  CCAFS LC-40
3     April    Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40
4     April              No attempt   F9 v1.1 B1016  CCAFS LC-40
5      June  Precluded (drone ship)   F9 v1.1 B1018  CCAFS LC-40
6  December    Success (ground pad)     F9 FT B1019  CCAFS LC-40

In [41]:
# %sql SELECT CASE substr(Date, 4, 2) WHEN '01' THEN 'January' WHEN '02' THEN 'February' WHEN '03' THEN 'March' WHEN '04' THEN 'April' WHEN '05' THEN 'May' WHEN '06' THEN 'June' WHEN '07' THEN 'July' WHEN '08' THEN 'August' WHEN '09' THEN 'September' WHEN '10' THEN 'October' WHEN '11' THEN 'November' WHEN '12' THEN 'December' END AS Month, landing_outcomes, booster_version, launch_site FROM SPACEXTBL WHERE substr(Date,7,4)='2015';

In [ ]:
# SELECT CASE substr(Date, 4, 2)
#         WHEN '01' THEN 'January'
#         WHEN '02' THEN 'February'
#         WHEN '03' THEN 'March'
#         WHEN '04' THEN 'April'
#         WHEN '05' THEN 'May'
#         WHEN '06' THEN 'June'
#         WHEN '07' THEN 'July'
#         WHEN '08' THEN 'August'
#         WHEN '09' THEN 'September'
#         WHEN '10' THEN 'October'
#         WHEN '11' THEN 'November'
#         WHEN '12' THEN 'December'
#     END AS Month,
#     landing_outcomes,
#     booster_version,
#     launch_site
# FROM SPACEXTBL
# WHERE substr(Date,7,4)='2015'

### Task 10




##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [47]:
# %sql select * from SPACEXTBL where Landing__Outcome like 'Success%' and (DATE between '2010-06-04' and '2017-03-20') order by date desc

In [45]:
cur.execute("select * from SPACEXTBL where landing_outcome like 'Success%' and (DATE between '2010-06-04' and '2017-03-20') order by date desc")
rows = cur.fetchall()
# print(rows)
rows=pd.DataFrame(rows)
# rows.columns = [description[0] for description in cur.description]
rows

Empty DataFrame
Columns: []
Index: []

In [57]:
cur.execute("select landing_outcome as 'Landing_Outcomes' COUNT(Landing_Outcomes) as 'Total COUNT' FROM SPACEXTBL where landing_outcome like 'Success%' and (DATE between '2010-06-04' and '2017-03-20') GROUP BY LANDING_OUTCOME ORDER BY COUNT(LANDING_OUTCOME) DESC")
rows = cur.fetchall()
# print(rows)
rows=pd.DataFrame(rows)
# rows.columns = [description[0] for description in cur.description]
rows

OperationalError: near "COUNT": syntax error

In [63]:
cur.execute("SELECT landing_outcome as landing_outcome, COUNT(landing_outcome) as 'Total COUNT' FROM SPACEXTBL WHERE landing_outcome LIKE 'Success%' AND (DATE BETWEEN '2010-06-04' AND '2017-03-20') GROUP BY LANDING_OUTCOME ORDER BY COUNT(LANDING_OUTCOME) DESC")
rows = cur.fetchall()
rows=pd.DataFrame(rows)
# rows.columns = [description[0] for description in cur.description]
rows

Empty DataFrame
Columns: []
Index: []

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center">  IBM Corporation 2021. All rights reserved. <h3/>